Жукова, вариант 10

2. Показатель точности с перекрестной проверкой равен acc = 0.721. Визуализация не проводилась.

3. С помощью бэггинга была построена модель для 30 деревьев (оптимальное значение). Точность модели 0.792

4. Наилучшей моделью оказался бэггинг, так как имеет наибольшую точность acc = 0.792
Точность дерева с обрезкой: 0.721
Точность бэггинга: 0.792

5.  Прогноз на отложенные наблюдения
Точность на отложенных наблюдениях: 0.792
Отчет по классификации:
              precision    recall  f1-score   support

           0       0.72      0.80      0.76        98
           1       0.85      0.79      0.82       142

    accuracy                           0.79       240
   macro avg       0.79      0.79      0.79       240
weighted avg       0.80      0.79      0.79       240

Точность прогноза составила 0.79

6. Сравнив точность полученного прогноза с точностью прогноза из предыдущей работы, получим, что прогноз, построенный методом бэггинга(точность 0.79), лучше, чем прогноз, построенный PLS-моделью (0.737)
